#map = affine_map<() -> (0, 10)>
#map1 = affine_map<()[s0] -> (0, s0)>
#map2 = affine_map<() -> (0, 1024)>
#map3 = affine_map<() -> ()>
#map4 = affine_map<(d0, d1)[s0] -> (d0 ceildiv s0, d1 ceildiv s0)>
#map5 = affine_map<(d0, d1) -> (d0, d1)>
#map6 = affine_map<(d0, d1, d2) -> (d2, d1)>
#map7 = affine_map<(d0, d1, d2) -> (d0, d2)>
#map8 = affine_map<(d0, d1, d2) -> (d0, d1)>
module attributes {torch.debug_module_name = "MLP"} {
  %0 = hls.dse.space @global() : () -> !hls.space {
    %1 = hls.dse.space @task0() : () -> !hls.space {
      %3 = hls.dse.const_param <impl> {value = #hls.impl<"" _ "">} : !hls.impl
      %4 = hls.dse.const_param <tile> {value = 0 : index} : index
      %5 = hls.dse.param @tile1 <tile> range() #map step 1 {value = 0 : index} : index
      %6 = hls.dse.space @default(%4, %5) : (index, index) -> !hls.space {
      ^bb0(%arg0: index, %arg1: index):
        %8 = hls.dse.param @parallel0 <parallel> range(%arg0) #map1 step 1 {value = 0 : index} : index
        %9 = hls.dse.param @parallel1 <parallel> range(%arg1) #map1 step 1 {value = 0 : index} : index
        hls.dse.space_pack %8, %9 : index, index
      }
      %7 = hls.dse.space_select %3 [#hls.impl<"" _ "">] %6 : !hls.impl, (!hls.space) -> !hls.space
      hls.dse.space_pack %4, %5, %7 : index, index, !hls.space
    }
    %2 = hls.dse.space @task1() : () -> !hls.space {
      %3 = hls.dse.const_param <tile> {value = 0 : index} : index
      %4 = hls.dse.param @tile1 <tile> range() #map step 1 {value = 0 : index} : index
      %5 = hls.dse.param @tile2 <tile> range() #map2 step 1 {value = 0 : index} : index
      %6 = hls.dse.space @default(%3, %4, %5) : (index, index, index) -> !hls.space {
      ^bb0(%arg0: index, %arg1: index, %arg2: index):
        %10 = hls.dse.param @parallel0 <parallel> range(%arg0) #map1 step 1 {value = 0 : index} : index
        %11 = hls.dse.param @parallel1 <parallel> range(%arg1) #map1 step 1 {value = 0 : index} : index
        %12 = hls.dse.param @parallel2 <parallel> range(%arg2) #map1 step 1 {value = 0 : index} : index
        hls.dse.space_pack %10, %11, %12 : index, index, index
      }
      %7 = hls.dse.space @vitis_gemm() : () -> !hls.space {
        %10 = hls.dse.const_param <template> {value = 1024 : index} : index
        %11 = hls.dse.const_param <template> {value = 32 : index} : index
        %12 = hls.dse.param @t_ParEntries <template> candidates [2 : index, 4 : index, 8 : index] {value = 4 : index} : index
        hls.dse.space_pack %11, %12, %10 ["k_KBufferDim", "t_ParEntries", "t_MaxSizeC"] : index, index, index
      }
      %8 = hls.dse.param @candidates <impl> candidates [#hls.impl<"" _ "">, #hls.impl<"vitis" _ "gemm">] {value = #hls.impl<"vitis" _ "gemm">} : !hls.impl
      %9 = hls.dse.space_select %8 [#hls.impl<"" _ "">, #hls.impl<"vitis" _ "gemm">] %6, %7 : !hls.impl, (!hls.space, !hls.space) -> !hls.space
      hls.dse.space_pack %3, %4, %5, %9 : index, index, index, !hls.space
    }
  }
  hls.uip.library @vitis {
    hls.uip.declare @gemm {
      hls.uip.include ["Vitis_Libraries/blas/L1/include/hw/xf_blas/gemm.hpp"]
      %1 = hls.dse.param @t_DataType <template> candidates [f32] : !hls.type
      %2 = hls.dse.param @t_IndexType <template> candidates [index] : !hls.type
      %3 = hls.dse.param @k_KBufferDim <template> candidates [32 : index] : index
      %4 = hls.dse.param @t_ParEntries <template> candidates [2 : index, 4 : index, 8 : index] : index
      %5 = hls.dse.param @t_MaxSizeC <template> candidates [1024 : index] : index
      %6 = hls.uip.port @p_m <param> type %2 sizes() #map3 : () -> !hls.port
      %7 = hls.uip.port @p_n <param> type %2 sizes() #map3 : () -> !hls.port
      %8 = hls.uip.port @p_k <param> type %2 sizes() #map3 : () -> !hls.port
      %9 = hls.uip.port @p_test <param> type %2 sizes() #map3 : () -> !hls.port
      %10 = hls.uip.port @p_alpha <param> type %1 sizes() #map3 {value = 1.000000e+00 : f32} : () -> !hls.port
      %11 = hls.uip.port @p_beta <param> type %1 sizes() #map3 {value = 0.000000e+00 : f32} : () -> !hls.port
      %12 = hls.uip.port @p_a <input> type %1 sizes(%6, %8) #map4 : (!hls.port, !hls.port) -> !hls.port
      %13 = hls.uip.port @p_b <input> type %1 sizes(%8, %7) #map5 : (!hls.port, !hls.port) -> !hls.port
      %14 = hls.uip.port @p_c <input> type %1 sizes(%6, %7) #map5 : (!hls.port, !hls.port) -> !hls.port
      %15 = hls.uip.port @p_r <output> type %1 sizes(%6, %7) #map5 : (!hls.port, !hls.port) -> !hls.port
      hls.uip.struct @my_test_struct<%3, %4, %5> (%6, %7) : <index, index, index> (!hls.port, !hls.port)
      hls.uip.emitinst ["gemm<k_KBufferDim>(p_m)"]
      hls.uip.semantics<%1, %2, %3, %4, %5> (%12, %13, %14, %15, %6, %7, %8, %10, %11) [0 : index, 1 : index, 2 : index, 3 : index] : <!hls.type, !hls.type, index, index, index> (!hls.port, !hls.port, !hls.port, !hls.port, !hls.port, !hls.port, !hls.port, !hls.port, !hls.port) {
      ^bb0(%arg0: tensor<?x?xf32>, %arg1: tensor<?x?xf32>, %arg2: tensor<?x?xf32>, %arg3: tensor<?x?xf32>):
        %16 = linalg.generic {indexing_maps = [#map6, #map7, #map8], iterator_types = ["parallel", "parallel", "reduction"]} ins(%arg1, %arg0 : tensor<?x?xf32>, tensor<?x?xf32>) outs(%arg2 : tensor<?x?xf32>) {
        ^bb0(%in: f32, %in_0: f32, %out: f32):
          %17 = arith.mulf %in, %in_0 : f32
          %18 = arith.addf %out, %17 : f32
          linalg.yield %18 : f32
        } -> tensor<?x?xf32>
        hls.uip.semantics.output %16 -> %arg3 : (tensor<?x?xf32>) -> tensor<?x?xf32>
      }
    }
  }
  ml_program.global private mutable @global_seed(dense<0> : tensor<i64>) : tensor<i64>
  func.func @forward_node0(%arg0: memref<1x10xf32>, %arg1: memref<10xf32>, %arg2: memref<1x10xf32>) {
    affine.for %arg3 = 0 to 1 {
      affine.for %arg4 = 0 to 10 {
        %1 = affine.load %arg0[0, %arg4] : memref<1x10xf32>
        %2 = affine.load %arg1[%arg4] : memref<10xf32>
        %3 = arith.addf %1, %2 : f32
        affine.store %3, %arg2[%arg3, %arg4] : memref<1x10xf32>
      }
    }
    return
  }
  func.func @forward_node1(%arg0: memref<1x1024xf32>, %arg1: memref<1024x10xf32>, %arg2: memref<1x10xf32>) {
    %c1 = arith.constant 1 : index
    %c10 = arith.constant 10 : index
    %c1024 = arith.constant 1024 : index
    %cst = arith.constant 1.000000e+00 : f32
    %cst_0 = arith.constant 0.000000e+00 : f32
    hls.uip.instance @vitis::@gemm<[f32, index, 32 : index, 4 : index, 1024 : index]> (%arg0, %arg1, %arg2, %arg2, %c1, %c10, %c1024, %cst, %cst_0) : (memref<1x1024xf32>, memref<1024x10xf32>, memref<1x10xf32>, memref<1x10xf32>, index, index, index, f32, f32) -> ()
    return
  }
  func.func @forward_node2(%arg0: memref<1x1x32x32xf32>, %arg1: memref<1x1024xf32>) {
    affine.for %arg2 = 0 to 1024 {
      %1 = affine.load %arg0[0, 0, %arg2 floordiv 32, %arg2 mod 32] : memref<1x1x32x32xf32>
      affine.store %1, %arg1[0, %arg2] : memref<1x1024xf32>
    }
    return
  }
  func.func @forward(%arg0: memref<1x1x32x32xf32>, %arg1: memref<1x10xf32>, %arg2: memref<1024x10xf32>) attributes {__top__} {
    %1 = hls.ubuf.const_buffer {value = dense<[-0.0119193979, -0.0311003253, 0.0288311355, -0.0171899647, 0.0098619908, -0.0205579549, -0.0188995264, 0.0128917471, -0.0134640597, 0.0187233612]> : tensor<10xf32>} : memref<10xf32>
    %2 = hls.ubuf.buffer {depth = 1 : i32} : memref<1x1024xf32>
    call @forward_node2(%arg0, %2) : (memref<1x1x32x32xf32>, memref<1x1024xf32>) -> ()
    %3 = hls.ubuf.buffer {depth = 1 : i32, init_value = 0.000000e+00 : f32} : memref<1x10xf32>
    call @forward_node1(%2, %arg2, %3) : (memref<1x1024xf32>, memref<1024x10xf32>, memref<1x10xf32>) -> ()
    call @forward_node0(%3, %1, %arg1) : (memref<1x10xf32>, memref<10xf32>, memref<1x10xf32>) -> ()
    return
  }
  func.func @runtime(%arg0: memref<1x1x32x32xf32>) -> memref<1x10xf32> attributes {__runtime__} {
    %1 = hls.ubuf.buffer {depth = 1 : i32} : memref<1x10xf32>
    %2 = hls.ubuf.const_buffer {value = 